Repository: nomadicnem/Semantik
Catalog: src/po/*.po
Languages: it

source: Empty
it: Vuoto

source: Flag item(s) as...
it: Contrassegna l'oggetto(i) come ...

source: Automatic save failed for file: %1
it: Salvataggio automatico non riuscito per il file:% 1

source: %1 saved automatically
it: %1 salvato automaticamente

source: Color %1
it: Colore% 1

source: File saving: missing file %1
it: Salvataggio di file: file mancante% 1

source: Missing bindings for opening files
it: Collegamenti mancanti per l'apertura di file

source: Missing filter file %1 for opening files
it: Filtro File mancante% 1 per aprire i file

source: Broken installation
it: Installazione corrotta

source: Missing python bindings for opening files
it: Associazioni Python mancanti per l'apertura di file

source: Python execution failure
it: Errore nell'esecuzione di Python

source: Could not load the document %1
it: Impossibile caricare il documento% 1

source: Broken document
it: Documento corrotto

source: Could not load the picture %1
it: Impossibile caricare l'immagine% 1

source: Something is wrong with %1
it: C'è qualcosa di sbagliato con % 1

source: Rename the picture %1 to %2 failed
it: Rinomina l'immagine da% 1 a% 2 non riuscita

source: Cannot create a reference: a direct link already exists
it: Impossibile creare un riferimento: esiste già un collegamento diretto

source: Cannot create a reference: a reference already exists
it: Impossibile creare un riferimento: esiste già

source: Cannot create a link: only one root is allowed (try references?)
it: Impossibile creare un collegamento: è consentita una sola radice (provare i riferimenti?)

source: Cannot create a link: cycles are not allowed (try references?)
it: Impossibile creare un collegamento: i cicli non sono consentiti (provare i riferimenti?)

source: Cannot create a link: a reference already exists
it: Impossibile creare un collegamento: esiste già

source: Code generation failed: no root item
it: Generazione codice fallita: nessun elemento radice

source: Code generation failed: missing file %1
it: Generazione codice fallita: file mancante% 1

source: Could not rename the output folder %1
it: Impossibile rinominare la cartella di output% 1

source: Could not create the output folder %1
it: Impossibile creare la cartella di output% 1

source: Document generation failed, check the output folder
it: Generazione del documento fallita, controllare la cartella di output

source: Document generation completed successfully
it: Generazione del documento completata con successo

source: Toggle fullscreen
it: Passa a schermo intero

source: Add an element
it: Aggiungi un elemento

source: Delete selection
it: Elimina selezione

source: Insert a sibling
it: Inserisci un fratello

source: Move up
it: Sposta in alto

source: Move down
it: Sposta in basso

source: Move left
it: Sposta a sinistra

source: Move right
it: Sposta a destra

source: Select up
it: Seleziona su

source: Select down
it: Seleziona giù

source: Select left
it: Seleziona a sinistra

source: Select right
it: Seleziona a destra

source: Select subtree
it: Selezionare sotto-albero

source: Next root
it: Prossima radice

source: Toggle edit
it: Attiva/disattiva modifica

source: Cancel edit
it: Annulla modifica

source: Text
it: Testo

source: Diagram
it: Diagramma

source: Table
it: Tabella

source: Image
it: Immagine

source: Click to set Item %1
it: Fai clic per impostare l'elemento% 1

source: *.png|PNG Files (*.png) *.svg|SVG Files (*.svg) *.pdf|PDF Files (*.pdf)
it: * .png|PNG Files (* .png) * .svg|File SVG (* .svg) * .pdf|File PDF (* .pdf)

source: No destination file selected
it: Nessun file di destinazione selezionato

source: Exported '%1'
it: Esportato '% 1'

source: Could not save to %1
it: Impossibile salvare su% 1

source: Missing picture
it: Foto mancante

source: Semantik map
it: Mappa di Semantik

source: Printing cancelled
it: Stampa annullata

source: Printing completed
it: Stampa completata

source: Problem during printing :-(
it: Problema durante la stampa :-(

source: Settings
it: Impostazioni

source: Document settings
it: Impostazioni del documento

source: Global settings
it: Impostazioni globali

source: Default variables
it: Variabili predefinite

source: Background color
it: Colore di sfondo

source: Arrow color
it: Colore della freccia

source: Reference color
it: Colore di riferimento

source: Preview pictures
it: Anteprima delle immagini

source: Reorganization type
it: Tipo di riorganizzazione

source: Item position after keyboard insertion
it: Posizione dell'articolo dopo l'inserimento della tastiera

source: Connection type
it: Tipo di connessione

source: Save document automatically
it: Salva il documento automaticamente

source: Touchpad mode
it: Modalità touchpad

source: Fixed
it: Fisso

source: Close to parent
it: Vicino al genitore

source: Reorganize map
it: Riorganizza la mappa

source: Lines
it: Linee

source: Splines
it: Interpola

source: Interval in minutes for saving the document automatically, 0 for disabling this feature
it: Intervallo in minuti per il salvataggio automatico del documento, 0 per disabilitare questa funzione

source: <h3>1. Essential commands</h3> <ul> <li>Double click to add a concept, type &quot;Enter&quot; to edit it</li> <li>Double click on a leaf or use the link mode to connect concepts</li> <li>Double click on a link to remove it</li> <li>Middle button + move to scroll on the map</li> <li>Scroll wheel for zooming</li> <li>When a concept is selected, press enter to start editing it</li> <li>Control+R to reorganize the map</li> <li>Control+H to center the zoom on selected objects</li> <li>When a map is ready, use Ctrl+G to generate a document</li> </ul>
it: <H3> 1. Comandi essenziali </ h3> <Ul> <li> Fai doppio clic per aggiungere un concetto, digita & quot; inserisci & quot; per modificarlo </ li> <li> Fai doppio clic su una foglia o utilizza la modalità di collegamento per connettere i concetti </ li> <li> Fai doppio clic su un link per rimuoverlo </ li> <li> Pulsante centrale + sposta per scorrere sulla mappa </ li> <li> Scorri la rotellina per lo zoom </ li> <li> Quando viene selezionato un concetto, premi Invio per iniziare a modificarlo </ li> <li> Control + R per riorganizzare la mappa </ li> <li> Control + H per centrare lo zoom sugli oggetti selezionati </ li> <li> Quando una mappa è pronta, usa Ctrl + G per generare un documento </ li> </ Ul>

source: <h3>2. Adding diagrams</h3> <ul> <li>right-click on a map item and select data type: diagram</li> <li>in the data view, double click to add a diagram item</li> <li>to remove a connection, double click on it</li> <li>right click on a connection or on an item to change the colors</li> </ul>
it: <H3> 2. Aggiunta di diagrammi </ h3> <Ul> <li> fai clic con il tasto destro del mouse su un elemento della mappa e seleziona il tipo di dati: diagramma </ li> <li> nella visualizzazione dati, fai doppio clic per aggiungere un elemento del diagramma </ li> <li> per rimuovere una connessione, fai doppio clic su di essa </ li> <li> tasto destro su una connessione o su un oggetto per cambiare i colori </ li> </ Ul>

source: <h3>3. Advanced features</h3> <ul> <li>Control+Enter to add a child, Shift+Enter to add a sibling</li> <li>Up,Left,Down,Right arrows to navigate one item at a time</li> <li>PageUp/PageDown to cycle between trees</li> <li>Alt + Up,Left,Down,Right arrows to move items</li> <li>Control + left click on items to link them</li> <li>Add document generator hints using the 'Variables' dock widget, for example fancy_off=fancy_off (format is key=value)</li> </ul>
it: <H3> 3. Funzioni avanzate </ h3> <Ul> <li> Controllo + Invio per aggiungere un bambino, Maiusc + Invio per aggiungere un fratello </ li> <li> Freccia su, sinistra, giù, destra per navigare un elemento alla volta </ li> <li> PageUp / PageDown per passare da un albero all'altro </ li> <li> Alt + Freccia su, sinistra, giù, destra per spostare gli elementi </ li> <li> Controllo + clic sinistro sugli elementi per collegarli </ li> <li> Aggiungi suggerimenti per il generatore di documenti usando il widget del dock 'Variabili', ad esempio fancy_off = fancy_off (il formato è chiave = valore) </ li> </ Ul>

source: <h3>4. Data types</h3> <ul> <li>Right-click on a map item to set its the data type such as text, table, graph or picture</li> <li>Edit the item extra data in the data panel</li> <li>Such extra data is not visible on the main map, but are exported in the resulting documents</li> </ul>
it: <H3> 4. Tipi di dati </ h3> <Ul> <li> Fai clic con il pulsante destro del mouse su un elemento della mappa per impostarne il tipo di dati, ad esempio testo, tabella, grafico o immagine </ li> <li> Modifica l'elemento dati extra nel pannello dati </ li> <li> Tali dati aggiuntivi non sono visibili sulla mappa principale, ma vengono esportati nei documenti risultanti </ li> </ Ul>

source: <h3>5. Diagrams</h3> <ul> <li>To connect diagram elements, drag the pointer from one box to another while maintaining the shift key pressed</li> <li>Right-click on a link or on a box to change the properties</li> <li>Diagrams can be saved as individual files and edited with the <b>semantik-d</b> application</li> </ul>
it: <H3> 5. Diagrammi </ h3> <Ul> <li> Per connettere gli elementi del diagramma, trascina il puntatore da una casella all'altra mantenendo premuto il tasto Maiusc </ li> <li> Fai clic con il pulsante destro del mouse su un link o su una casella per modificare le proprietà </ li>

source: <h3>6. LaTeX export</h3> <p> Set <b>all_latex=1</b> in the variables view to let the Beamer and Pdf templates use LaTeX commands. </p>
it: <H3> 6. Esportazione LaTeX </ h3> <P> Imposta <b> all_latex = 1 </ b> nella vista delle variabili per consentire ai modelli di Beamer e Pdf di utilizzare i comandi LaTeX. </ P>

source: <h3>7. Diagram size</h3> <p> The size of the diagrams exported can be tuned by specific values in the variables view:<br> <b>diagram_width</b>=200<br> <b>diagram_height</b>=500<br> </p>
it: <H3> 7. Dimensioni del diagramma </ h3> <P> La dimensione dei diagrammi esportati può essere regolata da valori specifici nella vista delle variabili: <br> <B> diagram_width </ b> = 200 <br> <B> diagram_height </ b> = 500 <br> </ P>

source: <h3>8. Diagram editor</h3> <p> The application called "semantik-d" can be used to create diagrams individually. The diagrams can be imported or exported from the diagram view of semantik. Additionally, the diagrams can be exported to a variety of formats by using the command-line. Just specify the extension, and a diagram will be produced if it is supported: <pre>semantik-d /tmp/foo.semd -o /tmp/foo.svg</pre> The options &quot;--width&quot; and &quot;--height&quot; can be used to change the size of Png files. </p>
it: <H3> 8. Editor di diagrammi </ h3> <P> L'applicazione denominata "semantik-d" può essere utilizzata per creare diagrammi singolarmente. I diagrammi possono essere importati o esportati dalla vista diagramma di semantik.

source: <h3>9. Code snippets</h3> <p> Code snippets can be highlighted by Pygments in html, S5, Beamer, Pdflatex or html documents. Enable Pygments by setting adding source code in the data box and adding the variable <i>code_lang</i> to the variables box, for example: <pre>code_lang=java</pre> </p>
it: <H3> 9. Frammenti di codice </ h3> <P> Gli snippet di codice possono essere evidenziati da Pygments nei documenti html, S5, Beamer, Pdflatex o html. Abilita i Pygments impostando l'aggiunta di codice sorgente nella casella dati e aggiungendo la variabile <i> code_lang </ i> alla casella delle variabili, ad esempio: <pre> code_lang = java </ pre> </ P>

source: <h3>9. Links and references</h3> <p> Links can be created by selecting an item on the map, and dragging from the "+" sign to another item. Since links reflect the structure of the document generated from the map, they can contain any cycle. </p> <p> Special links called references allow cycles and do not appear in the generated documents. They they can be inserted by holding the "Control" key pressed while creating a link (dragging from the + sign). </p>
it: <H3> 9. Collegamenti e riferimenti </ h3> <P> I collegamenti possono essere creati selezionando un elemento sulla mappa e trascinando dal segno "+" a un altro elemento. Poiché i collegamenti riflettono la struttura del documento generato dalla mappa, possono contenere qualsiasi ciclo. </ P> <P> I collegamenti speciali denominati riferimenti consentono cicli e non compaiono nei documenti generati. Possono essere inseriti tenendo premuto il tasto "Control" durante la creazione di un collegamento (trascinando dal segno +). </ P>

source: <p align='center'>No item selected</p>
it: <p align = 'center'>Nessun elemento selezionato</p>

source: First Name
it: Cognome

source: Name
it: Nome

source: Organization
it: Organizzazione

source: Export the map
it: Esporta mappa

source: File to write
it: File da scrivere

source: Width
it: Larghezza

source: Height
it: Altezza

source: Actor properties
it: Proprietà dell'attore

source: Caption:
it: Didascalia:

source: Class properties
it: Proprietà di classe

source: No class name given
it: Nessun nome di classe dato

source: Missing class name
it: Nome classe mancante

source: Font properties
it: Proprietà dei caratteri

source: Entity properties
it: Proprietà delle entità

source: No entity name given
it: Nessun nome di entità dato

source: Missing entity name
it: Nome dell'entità mancante

source: Boundary properties
it: Proprietà di confine

source: Text position
it: Posizione del testo

source: Up
it: Su

source: Down
it: Giù

source: Link properties
it: Proprietà di collegamento

source: Link text
it: Link al testo

source: Origin cardinality
it: Cardinalità dell'origine

source: Target cardinality
it: Cardinalità di destinazione

source: Thickness
it: Spessore

source: Line Type
it: Modello di linea

source: Line Style
it: Stile della linea

source: Origin arrow
it: Freccia di origine

source: Target arrow
it: Freccia bersaglio

source: Straight
it: Dritta

source: Invisible line
it: Linea invisibile

source: Solid Line
it: Linea continua

source: Dash Line
it: Linea tratteggiata

source: Dot Line
it: Linea di punti

source: No arrow
it: Nessuna freccia

source: Triangle
it: Triangolo

source: Link
it: Collegamento

source: Inheritance
it: Eredità

source: Aggregation
it: Aggregazione

source: Last colunn: %1px, last row: %2px (size: %3 x %4)
it: Ultima colonna:%1px, ultima riga:%2px (dimensione:%3 x%4)

source: Column %1: %2px (size: %3 x %4)
it: Colonna%1:%2px (dimensione:%3x%4)

source: Row %1: %2px (size: %3 x %4)
it: Riga%1:%2px (dimensione:%3 x%4)

source: Properties...
it: Proprietà...

source: Activity
it: Attività

source: Ctrl+Return
it: Ctrl+Invio

source: Delete
it: Cancella

source: Raise
it: Aumenta

source: Send back
it: Rimanda

source: Floating text
it: Testo fluttuante

source: Component
it: Componente

source: Rectangle
it: Rettangolo

source: Node
it: Nodo

source: Decision
it: Decisione

source: Pipe
it: Tubo

source: Sequence
it: Sequenza

source: Activity start
it: Inizio attività

source: Activity end
it: Fine attività

source: Horizontal fork/join
it: Dividi/unisci orizzontalmente

source: Vertical fork/join
it: Dividi/unisci verticalmente

source: Actor
it: Attore

source: Usecase
it: Caso d'uso

source: Matrix
it: Matrice

source: Boundary
it: Confine

source: Class
it: Classe

source: Entity
it: Entità

source: Import from file...
it: Importa dal file ...

source: Export to file...
it: Esporta nel file ...

source: Copy image to clipboard
it: Copia l'immagine negli appunti

source: File operations
it: Operazioni sui file

source: More elements
it: Più elementi

source: Text Alignment
it: Allineamento del testo

source: Align left
it: Allinea a sinistra

source: Align center
it: Allinea al centro

source: Align right
it: Allineare a destra

source: Alignment
it: Allineamento

source: Align top
it: Allinea in alto

source: Align middle
it: Allinea al centro

source: Align bottom
it: Allinea in fondo

source: Size
it: Dimensione

source: Same width
it: Stessa larghezza

source: Same height
it: Stessa altezza

source: Same width and height
it: Stessa larghezza e altezza

source: Semantik diagram
it: Diagramma semantik

source: Choose a file to open
it: Scegli un file da aprire

source: *.semd|Semantik diagram (*.semd)
it: *.semd|Diagramma di Semantik (*.semd)

source: Choose a file name
it: Scegli un nome file

source: Saved '%1'
it: Salvato '%1"

source: The file "%1" could not be saved because an error happened. Try again?
it: Il file "%1" non può essere salvato perché si è verificato un errore. Riprovare?

source: Try again?
it: Riprovare?

source: Export the diagram
it: Esporta il diagramma

source: Rows
it: Righe

source: Columns
it: Colonne

source: Colors
it: Colori

source: &Export the diagram...
it: &Export il diagramma ...

source: Files
it: File

source: Color
it: Colore

source: Custom color
it: Colore personalizzato

source: This is Semantik-d
it: Questo è Semantik-d

source: [Untitled]
it: [Senza titolo]

source: Untitled
it: Senza titolo

source: The document "%1" has been modified. Do you want to save your changes or discard them?
it: Il documento "%1" è stato modificato. Vuoi salvare le tue modifiche o scartarle?

source: Close Document
it: Chiudi documento

source: [Modified]
it: [Modificato]

source: Semantik Diagram %1
it: Diagramma Semantik %1

source: %1 %2 - Semantik Diagram
it: %1 %2 - Diagramma Semantik

source: A file to open on startup
it: Un file da aprire all'avvio

source: Batch export as svg/pdf/png
it: Esportazione batch come svg/pdf/png

source: Diagram width for printing
it: Larghezza del diagramma per la stampa

source: Diagram height for printing
it: Altezza del diagramma per la stampa

source: Diagram box properties:
it: Proprietà del riquadro diagramma:

source: Text:
it: Testo:

source: Generate documents
it: Genera documenti

source: Generators
it: Generatori

source: Description
it: Descrizione

source: Location
it: Posizione

source: No document generator chosen.
it: Nessun generatore di documenti scelto.

source: Missing data
it: Dati mancanti

source: Invalid output directory %1
it: Directory di output non valida% 1

source: Missing location
it: Posizione mancante

source: Change picture
it: Cambia immagine

source: Clear picture
it: Cancella immagine

source: Click to set a picture
it: Clicca per impostare un'immagine

source: Select an item on the map
it: Seleziona un elemento sulla mappa

source: Choose a picture
it: Scegli una foto

source: *.png *.jpg *.jpeg *.gif|Image Files (*.png *.jpg *.jpeg *.gif)
it: *.png *.jpg *.jpeg *.gif|File immagine (*.png *.jpg *.jpeg *.gif)

source: Could not load the picture
it: Impossibile caricare l'immagine

source: A mind-mapping tool for KDE Available exclusively for open systems such as OpenSuse, Gentoo or Fedora.
it: Uno strumento di mappatura mentale per KDE Disponibile esclusivamente per sistemi aperti come OpenSuse, Gentoo o Fedora.

source: Batch document creation into the given folder (absolute path)
it: Creazione di documenti batch nella cartella specificata (percorso assoluto)

source: Batch document creation template pdflatex/beamer/html/s5/odp/odt
it: Modello di creazione di documenti batch pdflatex/beamer/html/s5/odp/odt

source: &Edit
it: &Modifica

source: &View
it: &Vista

source: &Tools
it: &Strumenti

source: &Settings
it: &Impostazioni

source: &Help
it: &Aiuto

source: Colors Toolbar
it: Toolbar dei Colori

source: Flags Toolbar
it: Toolbar Flags

# NAME OF TRANSLATORS
source: Your names
it: I tuoi nomi

# EMAIL OF TRANSLATORS
source: Your emails
it: Le tue e-mail

source: <p align='center'>No preview available<br/>at this time</p>
it: <p align = "center"> Nessuna anteprima disponibile <br/>in questo momento</p>

source: The map is empty, Semantik cannot create documents from it
it: La mappa è vuota, Semantik non posso creare documenti da questo

source: Empty map
it: Mappa vuota

source: Template folder %1 is not readable
it: La cartella modello%1 non è leggibile

source: &Reorganize the map
it: &Riorganizza la mappa

source: &Export the map...
it: &Esporta la mappa ...

source: &Generate...
it: &Crea...

source: Variables
it: Variabili

source: Preview
it: Anteprima

source: Linear view
it: Vista lineare

source: Welcome to Semantik
it: Benvenuti in Semantik

source: *.sem *.kdi *.mm *.vym|All Supported Files (*.sem *.kdi *.mm *.vym)
it: * .sem *.kdi *.mm *.vym|Tutti i file supportati (*.sem*.kdi *.mm*.vym)

source: Uncomment to set defaults to all documents
it: Decommenta per impostare i valori predefiniti su tutti i documenti

source: Commands can only be defined here
it: I comandi possono essere definiti solo qui

source: Add Row
it: Aggiungi Riga

source: Add a row
it: Aggiungi una riga

source: Add Column
it: Aggiungi Colonna

source: Add a column
it: Aggiungi una colonna

source: Remove Row
it: Rimuovi Riga

source: Remove a row
it: Rimuovi una riga

source: Remove Column
it: Rimuovi Colonna

source: Remove a column
it: Rimuovi una colonna

source: Redimension
it: Ridimensiona

source: Change table dimensions
it: Modifica le dimensioni della tabella

source: &Bold
it: &Grassetto

source: &Underline
it: &Sottolinea

source: Text color
it: Colore del testo

source: Unordered list
it: Lista non ordinata

source: Ordered list
it: Lista ordinata

source: Increase indentation
it: Aumenta rientro

source: Decrease indentation
it: Diminuisci rientro

source: Clear formatting
it: Cancella la formattazione

source: Link definition
it: Definizione del collegamento

source: Code complete
it: Codice completo
